'use strict';



//Angular-фреймворк (разработчик Google): 

//самый тяжелый по весу
//для больших и сложных приложений или маленьких, но склонных к разрастанию
//порог вхождения - высокий
//node.js
//TypeScript
//Webpack
//MVC pattern - шаблон проектирования для приложений, разледяет логику приложения на визуальную часть, контролирующую и выполняющую действия

//React - библиотека (разработчик Facebook)

//гибкий, можно многое настроить под себя
//node.js
//Препроцессор JSX
//Babel
//Webpack

//Vue.js - фреймворк (модуль состоит из отдельных частей html, js и css)

//прост в обучении
//чистый и красивый код, легковесный и быстрый
//node.js
//Webpack


